"use strict";

/*
Используя Math.random() необходимо сгенерировать массив, содержащий 5 цифр в 
диапазоне [0, 9].
После создания массива необходимо вывести в консоль следующие значения:
1. Сумму элементов массива
2. Минимальное значение в массиве
3. Новый массив, содержащий индексы сгенерированного выше массива, в которых 
значение равно 3.
Пример: Если у нас сгенерировался массив [2, 3, 5, 7, 3], то мы должны вывести 
в консоль массив [1, 4]. Такой массив получился потому что в сгенерированном
массиве тройки лежат под индексами 1 и 4. Если троек в сгенерированном массиве
не окажется, значит нужно будет вывести пустой массив.
*/

function getRandomArray(n) {
    const result = [];
    for (let i = 0; i < n; i++){
        result.push(Math.floor(Math.random() * 10));
    }
    return result;
}

const array = getRandomArray(5);
const sum = array.reduce((sum, current) => sum + current, 0);
const min = Math.min(...array);
const newArr = array.map((item, n) => item === 3 ? n : NaN).filter(item => !!item);
console.log(array);
console.log(`Сумму элементов массива: ${sum}`);
console.log(`Минимальное значение в массиве: ${min}`);
console.log(newArr);

